jimmywong2003/nrf5-bond-with-2nd-central-example/ble_app_hrs/main.c
        NRF_LOG_INFO("Erase bonds!");

        err_code = pm_peers_delete();
        APP_ERROR_CHECK(err_code);
}


/**@brief Function for starting advertising.
 */
void advertising_start(bool whitelist)
{
        ret_code_t ret;
        if (whitelist == true)
        {
                memset(m_whitelist_peers, PM_PEER_ID_INVALID, sizeof(m_whitelist_peers));
                m_whitelist_peer_cnt = (sizeof(m_whitelist_peers) / sizeof(pm_peer_id_t));

                peer_list_get(m_whitelist_peers, &m_whitelist_peer_cnt);

                ret = pm_whitelist_set(m_whitelist_peers, m_whitelist_peer_cnt);
                APP_ERROR_CHECK(ret);

                NRF_LOG_INFO("advertising_start, m_whitelist_peer_cnt = %d", m_whitelist_peer_cnt);
                if (m_whitelist_peer_cnt > 0)
                {
                        // Setup the device identies list.
                        // Some SoftDevices do not support this feature.
                        ret = pm_device_identities_list_set(m_whitelist_peers, m_whitelist_peer_cnt);
                        if (ret != NRF_ERROR_NOT_SUPPORTED)
                        {
                                APP_ERROR_CHECK(ret);
                        }
                        NRF_LOG_INFO("Advertising with whitelist");
                }
                else
                {
                        NRF_LOG_INFO("Peer record is empty. Without Whiltelist");
                }

                ret = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
                APP_ERROR_CHECK(ret);
        }
        else
        {
                //if (m_conn_handle == BLE_CONN_HANDLE_INVALID)
                {
                        NRF_LOG_INFO("Restart the advertising without whitelist");
                        ret = ble_advertising_restart_without_whitelist(&m_advertising);
                        if (ret != NRF_ERROR_INVALID_STATE)
                        {
                                APP_ERROR_CHECK(ret);
                        }
                }
        }
}



/**@brief Function for handling File Data Storage events.
 *
 * @param[in] p_evt  Peer Manager event.
 * @param[in] cmd
 */
static void fds_evt_handler(fds_evt_t const * const p_evt)
{
        if (p_evt->id == FDS_EVT_GC)
        {
                NRF_LOG_DEBUG("GC completed\n");
        }
}

static void stop_advertising_bond_timer(void)
{
        uint32_t err_code = NRF_SUCCESS;
        if (advertising_bond_timer_is_running)
        {
                err_code = app_timer_stop(m_advertising_bond_timer_id);
                APP_ERROR_CHECK(err_code);
                advertising_bond_timer_is_running = false;
        }

}

static void advertising_bond_timeout_handler(void * p_context)
{
        UNUSED_PARAMETER(p_context);

        uint32_t periph_link_cnt = ble_conn_state_n_peripherals(); // Number of peripheral links.
        if (periph_link_cnt == 1)//NRF_SDH_BLE_PERIPHERAL_LINK_COUNT)
        {
                NRF_LOG_INFO("Stop advertising for bonding!!!");
                (void) sd_ble_gap_adv_stop();
        }
}

static void on_advertising_for_bond_request(void)
{
        uint32_t err_code = NRF_SUCCESS;

        uint32_t periph_link_cnt = ble_conn_state_n_peripherals(); // Number of peripheral links.
        if (periph_link_cnt == 1)//NRF_SDH_BLE_PERIPHERAL_LINK_COUNT)
        {
                // Create timers.
                err_code = app_timer_create(&m_advertising_bond_timer_id,
                                            APP_TIMER_MODE_SINGLE_SHOT,
                                            advertising_bond_timeout_handler);
                APP_ERROR_CHECK(err_code);

                // Start application timers.
                err_code = app_timer_start(m_advertising_bond_timer_id, ADVERTISING_BOND_TIME_INTERVAL, NULL);
                APP_ERROR_CHECK(err_code);

                advertising_bond_timer_is_running = true;

                NRF_LOG_INFO("Press button BONDING_BUTTON");
                NRF_LOG_INFO("Start Advertising bonding for 2nd host!!");
                advertising_start(false);
        }
}

/**@brief Function for clearing other bond records in main loop
 *
 * @details This function is called when a pairing/bonding has just been successful.
 */
static void on_bonded (pm_peer_id_t const * p_handle, uint16_t event_size)
{
        uint32_t err_code;
        uint32_t n_peer, i;
        pm_peer_id_t peer_id, peer_id_prev = PM_PEER_ID_INVALID;



        n_peer = pm_peer_count();

        NRF_LOG_INFO("on_bonded: # peer %d, delete all except peer id = %d", n_peer, m_bonded_peer_id);
        for (i = 0; i < n_peer; i++)
        {
                peer_id      = pm_next_peer_id_get (peer_id_prev);
                peer_id_prev = peer_id;

                if (peer_id != PM_PEER_ID_INVALID && peer_id != m_bonded_peer_id)
                {
                        err_code = pm_peer_delete(peer_id);
                        APP_ERROR_CHECK(err_code);
                }
        }
        stop_advertising_bond_timer();

//        uint32_t periph_link_cnt = ble_conn_state_n_peripherals();    // Number of peripheral links.
//        if (periph_link_cnt  == NRF_SDH_BLE_PERIPHERAL_LINK_COUNT)
//        {
//                err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_LOCAL_HOST_TERMINATED_CONNECTION);
//                APP_ERROR_CHECK(err_code);
//        }
}


/**@brief Function for handling Peer Manager events.
 *
 * @param[in] p_evt  Peer Manager event.
 */
static void pm_evt_handler(pm_evt_t const * p_evt)
{
        ret_code_t err_code;

        NRF_LOG_INFO("pm_evt_handler, evt_id = %x", p_evt->evt_id);

        switch (p_evt->evt_id)
        {
        case PM_EVT_BONDED_PEER_CONNECTED:
        {
                NRF_LOG_INFO("PM_EVT_BONDED_PEER_CONNECTED");
                NRF_LOG_INFO("Connected to a previously bonded device.");
        } break;

        case PM_EVT_CONN_SEC_SUCCEEDED:
        {
                NRF_LOG_INFO("PM_EVT_CONN_SEC_SUCCEEDED");
                NRF_LOG_INFO("Connection secured: role: %d, conn_handle: 0x%x, procedure: %d.",
                             ble_conn_state_role(p_evt->conn_handle),
                             p_evt->conn_handle,
                             p_evt->params.conn_sec_succeeded.procedure);

                m_peer_id = p_evt->peer_id;

                switch (p_evt->params.conn_sec_succeeded.procedure)
                {
                case PM_LINK_SECURED_PROCEDURE_ENCRYPTION:
                        NRF_LOG_INFO("PM_LINK_SECURED_PROCEDURE_ENCRYPTION succeed.\r\n");

                        break;

                case PM_LINK_SECURED_PROCEDURE_BONDING:
                        NRF_LOG_INFO("PM_LINK_SECURED_PROCEDURE_BONDING succeed: Bonding has been successful.\r\n");


                        // // New bond. Clear the old ones.
                        m_bonded_peer_id = p_evt->peer_id;
                        err_code = app_sched_event_put ((void *)&m_bonded_peer_id, sizeof(pm_peer_id_t), (app_sched_event_handler_t)on_bonded);
                        APP_ERROR_CHECK(err_code);

                        break;

                case PM_LINK_SECURED_PROCEDURE_PAIRING:
                        NRF_LOG_INFO("PM_LINK_SECURED_PROCEDURE_PAIRING succeed.\r\n");
                        break;

                default:
                        break;
                }


