jimmywong2003/nrf5-bond-with-2nd-central-example/ble_app_hrs/main.c
        } break;

        case PM_EVT_CONN_SEC_FAILED:
        {
                /* Often, when securing fails, it shouldn't be restarted, for security reasons.
                 * Other times, it can be restarted directly.
                 * Sometimes it can be restarted, but only after changing some Security Parameters.
                 * Sometimes, it cannot be restarted until the link is disconnected and reconnected.
                 * Sometimes it is impossible, to secure the link, or the peer device does not support it.
                 * How to handle this error is highly application dependent. */

                NRF_LOG_INFO("PM_EVT_CONN_SEC_FAILED");
        } break;

        case PM_EVT_CONN_SEC_CONFIG_REQ:
        {
                // Reject pairing request from an already bonded peer.
                pm_conn_sec_config_t conn_sec_config = {.allow_repairing = false};
                pm_conn_sec_config_reply(p_evt->conn_handle, &conn_sec_config);

                NRF_LOG_INFO("PM_EVT_CONN_SEC_CONFIG_REQ");
        } break;

        case PM_EVT_STORAGE_FULL:
        {
                // Run garbage collection on the flash.
                err_code = fds_gc();
                if (err_code == FDS_ERR_BUSY || err_code == FDS_ERR_NO_SPACE_IN_QUEUES)
                {
                        // Retry.
                }
                else
                {
                        APP_ERROR_CHECK(err_code);
                }
        } break;
        case PM_EVT_PEER_DELETE_SUCCEEDED:
        {

                NRF_LOG_INFO("PM_EVT_PEERS_DELETE_SUCCEEDED");

        }
        break;
        case PM_EVT_PEERS_DELETE_SUCCEEDED:
        {

                NRF_LOG_INFO("PM_EVT_PEERS_DELETE_SUCCEEDED");
                //advertising_start(true);
                err_code = ble_advertising_restart_without_whitelist(&m_advertising);
                if (err_code != NRF_ERROR_INVALID_STATE)
                {
                        APP_ERROR_CHECK(err_code);
                }

        } break;

        case PM_EVT_LOCAL_DB_CACHE_APPLY_FAILED:
        {
                // The local database has likely changed, send service changed indications.
                pm_local_database_has_changed();
        } break;

        case PM_EVT_PEER_DATA_UPDATE_SUCCEEDED:
        {
                NRF_LOG_INFO("PM_EVT_PEER_DATA_UPDATE_SUCCEEDED");
                if (     p_evt->params.peer_data_update_succeeded.flash_changed
                         && (p_evt->params.peer_data_update_succeeded.data_id == PM_PEER_DATA_ID_BONDING))
                {
                        NRF_LOG_INFO("New Bond, add the peer to the whitelist if possible");
                        NRF_LOG_INFO("\tm_whitelist_peer_cnt %d, MAX_PEERS_WLIST %d",
                                     m_whitelist_peer_cnt + 1,
                                     BLE_GAP_WHITELIST_ADDR_MAX_COUNT);

                        // // Note: You should check on what kind of white list policy your application should use.
                        //
                        // if (m_whitelist_peer_cnt < BLE_GAP_WHITELIST_ADDR_MAX_COUNT)
                        // {
                        //         // Bonded to a new peer, add it to the whitelist.
                        //         m_whitelist_peers[m_whitelist_peer_cnt++] = m_peer_id;
                        //
                        //         // The whitelist has been modified, update it in the Peer Manager.
                        //         err_code = pm_device_identities_list_set(m_whitelist_peers, m_whitelist_peer_cnt);
                        //         if (err_code != NRF_ERROR_NOT_SUPPORTED)
                        //         {
                        //                 APP_ERROR_CHECK(err_code);
                        //         }
                        //
                        //         err_code = pm_whitelist_set(m_whitelist_peers, m_whitelist_peer_cnt);
                        //         APP_ERROR_CHECK(err_code);
                        // }

                        memset(m_whitelist_peers, PM_PEER_ID_INVALID, sizeof(m_whitelist_peers));
                        m_whitelist_peer_cnt = (sizeof(m_whitelist_peers) / sizeof(pm_peer_id_t));

                        peer_list_get(m_whitelist_peers, &m_whitelist_peer_cnt);

                        err_code = pm_whitelist_set(m_whitelist_peers, m_whitelist_peer_cnt);
                        APP_ERROR_CHECK(err_code);

                        if (m_whitelist_peer_cnt > 0)
                        {
                                // Setup the device identies list.
                                // Some SoftDevices do not support this feature.
                                err_code = pm_device_identities_list_set(m_whitelist_peers, m_whitelist_peer_cnt);
                                if (err_code != NRF_ERROR_NOT_SUPPORTED)
                                {
                                        APP_ERROR_CHECK(err_code);
                                }
                                NRF_LOG_INFO("Advertising with whitelist");
                        }

                }
        } break;

        case PM_EVT_PEER_DATA_UPDATE_FAILED:
        {
                // Assert.
                APP_ERROR_CHECK(p_evt->params.peer_data_update_failed.error);
        } break;

        case PM_EVT_PEER_DELETE_FAILED:
        {
                // Assert.
                APP_ERROR_CHECK(p_evt->params.peer_delete_failed.error);
        } break;

        case PM_EVT_PEERS_DELETE_FAILED:
        {
                // Assert.
                APP_ERROR_CHECK(p_evt->params.peers_delete_failed_evt.error);
        } break;

        case PM_EVT_ERROR_UNEXPECTED:
        {
                // Assert.
                APP_ERROR_CHECK(p_evt->params.error_unexpected.error);
        } break;

        case PM_EVT_CONN_SEC_START:

        case PM_EVT_LOCAL_DB_CACHE_APPLIED:
        case PM_EVT_SERVICE_CHANGED_IND_SENT:
        case PM_EVT_SERVICE_CHANGED_IND_CONFIRMED:
        default:
                break;
        }
}



/**@brief Function for performing battery measurement and updating the Battery Level characteristic
 *        in Battery Service.
 */
static void battery_level_update(void)
{
        ret_code_t err_code;
        uint8_t battery_level;

        battery_level = (uint8_t)sensorsim_measure(&m_battery_sim_state, &m_battery_sim_cfg);

        err_code = ble_bas_battery_level_update(&m_bas, battery_level);
        if ((err_code != NRF_SUCCESS) &&
            (err_code != NRF_ERROR_INVALID_STATE) &&
            (err_code != NRF_ERROR_RESOURCES) &&
            (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
            )
        {
                APP_ERROR_HANDLER(err_code);
        }
}


