jimmywong2003/nrf5-bond-with-2nd-central-example/ble_app_hrs/main.c
/**@brief Function for handling the Battery measurement timer timeout.
 *
 * @details This function will be called each time the battery level measurement timer expires.
 *
 * @param[in] p_context  Pointer used for passing some arbitrary information (context) from the
 *                       app_start_timer() call to the timeout handler.
 */
static void battery_level_meas_timeout_handler(void * p_context)
{
        UNUSED_PARAMETER(p_context);
        battery_level_update();
}


/**@brief Function for handling the Heart rate measurement timer timeout.
 *
 * @details This function will be called each time the heart rate measurement timer expires.
 *          It will exclude RR Interval data from every third measurement.
 *
 * @param[in] p_context  Pointer used for passing some arbitrary information (context) from the
 *                       app_start_timer() call to the timeout handler.
 */
static void heart_rate_meas_timeout_handler(void * p_context)
{
        static uint32_t cnt = 0;
        ret_code_t err_code;
        uint16_t heart_rate;

        UNUSED_PARAMETER(p_context);

        heart_rate = (uint16_t)sensorsim_measure(&m_heart_rate_sim_state, &m_heart_rate_sim_cfg);

        cnt++;
        err_code = ble_hrs_heart_rate_measurement_send(&m_hrs, heart_rate);
        if ((err_code != NRF_SUCCESS) &&
            (err_code != NRF_ERROR_INVALID_STATE) &&
            (err_code != NRF_ERROR_RESOURCES) &&
            (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
            )
        {
                APP_ERROR_HANDLER(err_code);
        }

        // Disable RR Interval recording every third heart rate measurement.
        // NOTE: An application will normally not do this. It is done here just for testing generation
        // of messages without RR Interval measurements.
        m_rr_interval_enabled = ((cnt % 3) != 0);
}


/**@brief Function for handling the RR interval timer timeout.
 *
 * @details This function will be called each time the RR interval timer expires.
 *
 * @param[in] p_context  Pointer used for passing some arbitrary information (context) from the
 *                       app_start_timer() call to the timeout handler.
 */
static void rr_interval_timeout_handler(void * p_context)
{
        UNUSED_PARAMETER(p_context);

        if (m_rr_interval_enabled)
        {
                uint16_t rr_interval;

                rr_interval = (uint16_t)sensorsim_measure(&m_rr_interval_sim_state,
                                                          &m_rr_interval_sim_cfg);
                ble_hrs_rr_interval_add(&m_hrs, rr_interval);
                rr_interval = (uint16_t)sensorsim_measure(&m_rr_interval_sim_state,
                                                          &m_rr_interval_sim_cfg);
                ble_hrs_rr_interval_add(&m_hrs, rr_interval);
                rr_interval = (uint16_t)sensorsim_measure(&m_rr_interval_sim_state,
                                                          &m_rr_interval_sim_cfg);
                ble_hrs_rr_interval_add(&m_hrs, rr_interval);
                rr_interval = (uint16_t)sensorsim_measure(&m_rr_interval_sim_state,
                                                          &m_rr_interval_sim_cfg);
                ble_hrs_rr_interval_add(&m_hrs, rr_interval);
                rr_interval = (uint16_t)sensorsim_measure(&m_rr_interval_sim_state,
                                                          &m_rr_interval_sim_cfg);
                ble_hrs_rr_interval_add(&m_hrs, rr_interval);
                rr_interval = (uint16_t)sensorsim_measure(&m_rr_interval_sim_state,
                                                          &m_rr_interval_sim_cfg);
                ble_hrs_rr_interval_add(&m_hrs, rr_interval);
        }
}


/**@brief Function for handling the Sensor Contact Detected timer timeout.
 *
 * @details This function will be called each time the Sensor Contact Detected timer expires.
 *
 * @param[in] p_context  Pointer used for passing some arbitrary information (context) from the
 *                       app_start_timer() call to the timeout handler.
 */
static void sensor_contact_detected_timeout_handler(void * p_context)
{
        static bool sensor_contact_detected = false;

        UNUSED_PARAMETER(p_context);

        sensor_contact_detected = !sensor_contact_detected;
        ble_hrs_sensor_contact_detected_update(&m_hrs, sensor_contact_detected);
}


/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application timers.
 */
static void timers_init(void)
{
        ret_code_t err_code;

        // Initialize timer module.
        err_code = app_timer_init();
        APP_ERROR_CHECK(err_code);

        // Create timers.
        err_code = app_timer_create(&m_battery_timer_id,
                                    APP_TIMER_MODE_REPEATED,
                                    battery_level_meas_timeout_handler);
        APP_ERROR_CHECK(err_code);

        err_code = app_timer_create(&m_heart_rate_timer_id,
                                    APP_TIMER_MODE_REPEATED,
                                    heart_rate_meas_timeout_handler);
        APP_ERROR_CHECK(err_code);

        err_code = app_timer_create(&m_rr_interval_timer_id,
                                    APP_TIMER_MODE_REPEATED,
                                    rr_interval_timeout_handler);
        APP_ERROR_CHECK(err_code);

        err_code = app_timer_create(&m_sensor_contact_timer_id,
                                    APP_TIMER_MODE_REPEATED,
                                    sensor_contact_detected_timeout_handler);
        APP_ERROR_CHECK(err_code);
}


/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
static void gap_params_init(void)
{
        ret_code_t err_code;
        ble_gap_conn_params_t gap_conn_params;
        ble_gap_conn_sec_mode_t sec_mode;

        BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

        err_code = sd_ble_gap_device_name_set(&sec_mode,
                                              (const uint8_t *)DEVICE_NAME,
                                              strlen(DEVICE_NAME));
        APP_ERROR_CHECK(err_code);

        err_code = sd_ble_gap_appearance_set(BLE_APPEARANCE_HEART_RATE_SENSOR_HEART_RATE_BELT);
        APP_ERROR_CHECK(err_code);

        memset(&gap_conn_params, 0, sizeof(gap_conn_params));

        gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
        gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
        gap_conn_params.slave_latency     = SLAVE_LATENCY;
        gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

        err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
        APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling events from the GATT library. */
void gatt_evt_handler(nrf_ble_gatt_t * p_gatt, nrf_ble_gatt_evt_t const * p_evt)
{
        NRF_LOG_INFO("ATT MTU exchange completed. central 0x%x peripheral 0x%x",
                     p_gatt->att_mtu_desired_central,
                     p_gatt->att_mtu_desired_periph);
}


/**@brief Function for initializing the GATT module.
 */
static void gatt_init(void)
{
        ret_code_t err_code;

        err_code = nrf_ble_gatt_init(&m_gatt, gatt_evt_handler);
        APP_ERROR_CHECK(err_code);

