jimmywong2003/nrf5-bond-with-2nd-central-example/ble_app_hrs/main.c
        err_code = ble_conn_params_init(&cp_init);
        APP_ERROR_CHECK(err_code);
}


/**@brief Function for putting the chip into sleep mode.
 *
 * @note This function will not return.
 */
static void sleep_mode_enter(void)
{
        ret_code_t err_code;

        err_code = bsp_indication_set(BSP_INDICATE_IDLE);
        APP_ERROR_CHECK(err_code);

        // Prepare wakeup buttons.
        err_code = bsp_btn_ble_sleep_mode_prepare();
        APP_ERROR_CHECK(err_code);

        // Go to system-off mode (this function will not return; wakeup will cause a reset).
        err_code = sd_power_system_off();
        APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling advertising events.
 *
 * @details This function will be called for advertising events which are passed to the application.
 *
 * @param[in] ble_adv_evt  Advertising event.
 */
static void on_adv_evt(ble_adv_evt_t ble_adv_evt)
{
        ret_code_t ret;

        switch (ble_adv_evt)
        {
        case BLE_ADV_EVT_FAST:
                NRF_LOG_INFO("Fast advertising.");
                ret = bsp_indication_set(BSP_INDICATE_ADVERTISING);
                APP_ERROR_CHECK(ret);
                break;

        case BLE_ADV_EVT_IDLE:
//                sleep_mode_enter();
                break;

        case BLE_ADV_EVT_FAST_WHITELIST:
                NRF_LOG_INFO("Fast advertising with Whitelist");
                ret = bsp_indication_set(BSP_INDICATE_ADVERTISING_WHITELIST);
                APP_ERROR_CHECK(ret);
                break;


        case BLE_ADV_EVT_WHITELIST_REQUEST:
        {
                ble_gap_addr_t whitelist_addrs[BLE_GAP_WHITELIST_ADDR_MAX_COUNT];
                ble_gap_irk_t whitelist_irks[BLE_GAP_WHITELIST_ADDR_MAX_COUNT];
                uint32_t addr_cnt = BLE_GAP_WHITELIST_ADDR_MAX_COUNT;
                uint32_t irk_cnt  = BLE_GAP_WHITELIST_ADDR_MAX_COUNT;

                ret = pm_whitelist_get(whitelist_addrs, &addr_cnt, whitelist_irks, &irk_cnt);
                APP_ERROR_CHECK(ret);
                NRF_LOG_INFO("pm_whitelist_get returns %d addr in whitelist and %d irk whitelist",
                             addr_cnt,
                             irk_cnt);

                // Apply the whitelist.
                ret = ble_advertising_whitelist_reply(&m_advertising,
                                                      whitelist_addrs,
                                                      addr_cnt,
                                                      whitelist_irks,
                                                      irk_cnt);
                APP_ERROR_CHECK(ret);
        }
        break;

        default:
                break;
        }
}




/**@brief Function for handling the Connected event.
 *
 * @param[in] p_gap_evt GAP event received from the BLE stack.
 */
static void on_connected(const ble_gap_evt_t * const p_gap_evt)
{
        ret_code_t err_code;
        uint32_t periph_link_cnt = ble_conn_state_n_peripherals(); // Number of peripheral links.

        NRF_LOG_INFO("Connection with link 0x%x established.", p_gap_evt->conn_handle);
        // Update LEDs
        bsp_board_led_on(CONNECTED_LED);

        // first device connection
        if (periph_link_cnt == 1)
        {
                m_conn_handle  = p_gap_evt->conn_handle;
        }

//         err_code = app_button_enable();
//         APP_ERROR_CHECK(err_code);
//
//         // Update LEDs
//         bsp_board_led_on(CONNECTED_LED);
//         if (periph_link_cnt == NRF_SDH_BLE_PERIPHERAL_LINK_COUNT)
//         {
//                 bsp_board_led_off(ADVERTISING_LED);
//         }
//         else
//         {
//                 // Continue advertising. More connections can be established because the maximum link count has not been reached.
// //                advertising_start();
//         }
}

/**@brief Function for handling the Disconnected event.
 *
 * @param[in] p_gap_evt GAP event received from the BLE stack.
 */
static void on_disconnected(ble_gap_evt_t const * const p_gap_evt)
{
        ret_code_t err_code;
        uint32_t periph_link_cnt = ble_conn_state_n_peripherals(); // Number of peripheral links.

        NRF_LOG_INFO("Connection 0x%x has been disconnected. Reason: 0x%X",
                     p_gap_evt->conn_handle,
                     p_gap_evt->params.disconnected.reason);

        if (m_conn_handle == p_gap_evt->conn_handle)
        {
                m_conn_handle = BLE_CONN_HANDLE_INVALID;
        }
        if (periph_link_cnt == 0)
        {
                advertising_start(true);
        }
        // if (periph_link_cnt == 0)
        // {
        //         bsp_board_led_off(CONNECTED_LED);
        //         err_code = app_button_disable();
        //         APP_ERROR_CHECK(err_code);
        // }
        //
        // if (periph_link_cnt == (NRF_SDH_BLE_PERIPHERAL_LINK_COUNT - 1))
        // {
        //         // Advertising is not running when all connections are taken, and must therefore be started.
        //         advertising_start();
        // }
}


/**@brief Function for handling BLE events.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 * @param[in]   p_context   Unused.
 */
static void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context)
{
        ret_code_t err_code;

        switch (p_ble_evt->header.evt_id)
        {
        case BLE_GAP_EVT_CONNECTED:
                NRF_LOG_INFO("Connected.");
                // err_code = bsp_indication_set(BSP_INDICATE_CONNECTED);
                // APP_ERROR_CHECK(err_code);
                // m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;

                on_connected(&p_ble_evt->evt.gap_evt);
                break;

        case BLE_GAP_EVT_DISCONNECTED:

                on_disconnected(&p_ble_evt->evt.gap_evt);
                // NRF_LOG_INFO("Disconnected, reason %d.",
                //              p_ble_evt->evt.gap_evt.params.disconnected.reason);
                // m_conn_handle = BLE_CONN_HANDLE_INVALID;
                // uint32_t periph_link_cnt = ble_conn_state_n_peripherals();    // Number of peripheral links.

                break;

#ifndef S140
        case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
        {
                NRF_LOG_DEBUG("PHY update request.");
                ble_gap_phys_t const phys =
                {
                        .rx_phys = BLE_GAP_PHY_AUTO,
                        .tx_phys = BLE_GAP_PHY_AUTO,
                };
                err_code = sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle, &phys);
                APP_ERROR_CHECK(err_code);
        } break;
#endif

#if !defined (S112)
        case BLE_GAP_EVT_DATA_LENGTH_UPDATE_REQUEST:
        {
                ble_gap_data_length_params_t dl_params;

                // Clearing the struct will effectivly set members to @ref BLE_GAP_DATA_LENGTH_AUTO
                memset(&dl_params, 0, sizeof(ble_gap_data_length_params_t));
                err_code = sd_ble_gap_data_length_update(p_ble_evt->evt.gap_evt.conn_handle, &dl_params, NULL);
                APP_ERROR_CHECK(err_code);
        } break;
#endif //!defined (S112)

        case BLE_GATTC_EVT_TIMEOUT:
                // Disconnect on GATT Client timeout event.
                NRF_LOG_DEBUG("GATT Client Timeout.");
                err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,
                                                 BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
                APP_ERROR_CHECK(err_code);
                break;

        case BLE_GATTS_EVT_TIMEOUT:
                // Disconnect on GATT Server timeout event.
                NRF_LOG_DEBUG("GATT Server Timeout.");
                err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle,
                                                 BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
                APP_ERROR_CHECK(err_code);
                break;

        case BLE_EVT_USER_MEM_REQUEST:
                //err_code = sd_ble_user_mem_reply(m_conn_handle, NULL);
                err_code = sd_ble_user_mem_reply(p_ble_evt->evt.gattc_evt.conn_handle, NULL);
                APP_ERROR_CHECK(err_code);
                break;

        case BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST:
        {
                ble_gatts_evt_rw_authorize_request_t req;
                ble_gatts_rw_authorize_reply_params_t auth_reply;

                req = p_ble_evt->evt.gatts_evt.params.authorize_request;

                if (req.type != BLE_GATTS_AUTHORIZE_TYPE_INVALID)
                {
                        if ((req.request.write.op == BLE_GATTS_OP_PREP_WRITE_REQ)     ||
                            (req.request.write.op == BLE_GATTS_OP_EXEC_WRITE_REQ_NOW) ||
                            (req.request.write.op == BLE_GATTS_OP_EXEC_WRITE_REQ_CANCEL))
                        {
                                if (req.type == BLE_GATTS_AUTHORIZE_TYPE_WRITE)
                                {
                                        auth_reply.type = BLE_GATTS_AUTHORIZE_TYPE_WRITE;
                                }
                                else
                                {
                                        auth_reply.type = BLE_GATTS_AUTHORIZE_TYPE_READ;
                                }
                                auth_reply.params.write.gatt_status = APP_FEATURE_NOT_SUPPORTED;
                                err_code = sd_ble_gatts_rw_authorize_reply(p_ble_evt->evt.gatts_evt.conn_handle,
                                                                           &auth_reply);
                                APP_ERROR_CHECK(err_code);
                        }
                }
        } break;


        default:
                // No implementation needed.
                break;
        }
}



/**@brief Function for initializing the BLE stack.
 *
 * @details Initializes the SoftDevice and the BLE event interrupt.
 */
static void ble_stack_init(void)
{
        ret_code_t err_code;

        err_code = nrf_sdh_enable_request();
        APP_ERROR_CHECK(err_code);

        // Configure the BLE stack using the default settings.
        // Fetch the start address of the application RAM.
        uint32_t ram_start = 0;
        err_code = nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start);
        APP_ERROR_CHECK(err_code);

        // Enable BLE stack.
        err_code = nrf_sdh_ble_enable(&ram_start);
        APP_ERROR_CHECK(err_code);

        // Register a handler for BLE events.
        NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, ble_evt_handler, NULL);
}


/**@brief Function for the Event Scheduler initialization.
 */
static void scheduler_init(void)
{
        APP_SCHED_INIT(SCHED_MAX_EVENT_DATA_SIZE, SCHED_QUEUE_SIZE);
}


/**@brief Function for handling events from the button handler module.
 *
 * @param[in] pin_no        The pin that the event applies to.
 * @param[in] button_action The button action (press/release).
 */
static void button_event_handler(uint8_t pin_no, uint8_t button_action)
{
        ret_code_t err_code;

