jimmywong2003/nrf5-bond-with-2nd-central-example/ble_app_hrs/main.c
        switch (pin_no)
        {
        case REMOVE_BOND_BUTTON:
                if (button_action == APP_BUTTON_PUSH)
                {
                        NRF_LOG_INFO("Press button to remove all the bonding record");
                        delete_bonds();
                }

                // err_code = led_status_send_to_all(button_action);
                // if (err_code == NRF_SUCCESS)
                // {
                //         NRF_LOG_INFO("Sent button state change to all connected centrals.");
                // }
                break;
        case BONDING_BUTTON:
                if (button_action == APP_BUTTON_PUSH)
                {
                        on_advertising_for_bond_request();
                }
                break;
        default:

                break;
        }
}
///**@brief Function for handling events from the BSP module.
// *
// * @param[in]   event   Event generated by button press.
// */
//void bsp_event_handler(bsp_event_t event)
//{
//        ret_code_t err_code;
//
//        switch (event)
//        {
////        case BSP_EVENT_SLEEP:
////                sleep_mode_enter();
////                break;
//
//        case BSP_EVENT_DISCONNECT:
//                err_code = sd_ble_gap_disconnect(m_conn_handle,
//                                                 BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
//                if (err_code != NRF_ERROR_INVALID_STATE)
//                {
//                        APP_ERROR_CHECK(err_code);
//                }
//                break;
//
//
//
//        case BSP_EVENT_WHITELIST_OFF:
//        case BSP_EVENT_KEY_1:
//                if (m_conn_handle == BLE_CONN_HANDLE_INVALID)
//                {
//                        NRF_LOG_INFO("Restart the advertising without whitelist");
//                        err_code = ble_advertising_restart_without_whitelist(&m_advertising);
//                        if (err_code != NRF_ERROR_INVALID_STATE)
//                        {
//                                APP_ERROR_CHECK(err_code);
//                        }
//                }
//                break;
//
//        default:
//                break;
//        }
//}


/**@brief Function for the Peer Manager initialization.
 */
static void peer_manager_init(void)
{
        ble_gap_sec_params_t sec_param;
        ret_code_t err_code;

        err_code = pm_init();
        APP_ERROR_CHECK(err_code);

        memset(&sec_param, 0, sizeof(ble_gap_sec_params_t));

        // Security parameters to be used for all security procedures.
        sec_param.bond           = SEC_PARAM_BOND;
        sec_param.mitm           = SEC_PARAM_MITM;
        sec_param.io_caps        = SEC_PARAM_IO_CAPABILITIES;
        sec_param.oob            = SEC_PARAM_OOB;
        sec_param.min_key_size   = SEC_PARAM_MIN_KEY_SIZE;
        sec_param.max_key_size   = SEC_PARAM_MAX_KEY_SIZE;
        sec_param.kdist_own.enc  = 1;
        sec_param.kdist_own.id   = 1;
        sec_param.kdist_peer.enc = 1;
        sec_param.kdist_peer.id  = 1;

        err_code = pm_sec_params_set(&sec_param);
        APP_ERROR_CHECK(err_code);

        err_code = pm_register(pm_evt_handler);
        APP_ERROR_CHECK(err_code);

        err_code = fds_register(fds_evt_handler);
        APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the Advertising functionality.
 */
static void advertising_init(void)
{
        ret_code_t err_code;
        ble_advertising_init_t init;
        uint8_t adv_flags;

        memset(&init, 0, sizeof(init));

        adv_flags                            = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;

        init.advdata.name_type               = BLE_ADVDATA_FULL_NAME;
        init.advdata.include_appearance      = true;
        init.advdata.flags                   = adv_flags;
        init.advdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
        init.advdata.uuids_complete.p_uuids  = m_adv_uuids;

        init.config.ble_adv_whitelist_enabled      = true;
        init.config.ble_adv_fast_enabled           = true;
        init.config.ble_adv_fast_interval          = APP_ADV_FAST_INTERVAL;
        init.config.ble_adv_fast_timeout           = APP_ADV_FAST_TIMEOUT;
        init.config.ble_adv_slow_enabled           = true;
        init.config.ble_adv_slow_interval          = APP_ADV_SLOW_INTERVAL;
        init.config.ble_adv_slow_timeout           = APP_ADV_SLOW_TIMEOUT;
        init.config.ble_adv_on_disconnect_disabled = true;

        init.evt_handler = on_adv_evt;

        err_code = ble_advertising_init(&m_advertising, &init);
        APP_ERROR_CHECK(err_code);

        ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}



/**@brief Function for initializing the button handler module.
 */
static void buttons_init(void)
{
        ret_code_t err_code;

        //The array must be static because a pointer to it will be saved in the button handler module.
        static app_button_cfg_t buttons[] =
        {
                {REMOVE_BOND_BUTTON, false, BUTTON_PULL, button_event_handler},
                {BONDING_BUTTON, false, BUTTON_PULL, button_event_handler},
        };

        err_code = app_button_init(buttons, sizeof(buttons) / sizeof(buttons[0]),
                                   BUTTON_DETECTION_DELAY);
        APP_ERROR_CHECK(err_code);
}



/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
        ret_code_t err_code = NRF_LOG_INIT(NULL);
        APP_ERROR_CHECK(err_code);

        NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for the Power manager.
 */
static void power_manage(void)
{
        ret_code_t err_code = sd_app_evt_wait();
        APP_ERROR_CHECK(err_code);
}


/**@brief Function for application main entry.
 */
int main(void)
{
        ret_code_t err_code;

        // Initialize.
        log_init();
        timers_init();
        buttons_init();
        ble_stack_init();
        scheduler_init();
        gap_params_init();
        gatt_init();
        advertising_init();
        services_init();
        sensor_simulator_init();
        conn_params_init();
        peer_manager_init();

        // Start execution.
        NRF_LOG_INFO("Heart Rate Sensor example started.");
        application_timers_start();

        advertising_start(true);
        err_code = app_button_enable();
        APP_ERROR_CHECK(err_code);

        advertising_bond_timer_is_running = false;

        // Enter main loop.
        for (;;)
        {
                app_sched_execute();
                if (NRF_LOG_PROCESS() == false)
                {
                        power_manage();
                }
        }
}
